### Importing library

In [1]:
import pandas as pd
import numpy as np
import re
import warnings

warnings.filterwarnings('ignore')

In [2]:
# Load csv file into a pandas DataFrame and correcting delimiter and encoding error
df = pd.read_csv("messy_data.csv", delimiter=';', encoding='latin-1')

In [3]:
# Interogating the data in the dataset
df.info

<bound method DataFrame.info of     IMBD title ID               Original titlÊ  Release year  \
0       tt0111161     The Shawshank Redemption    1995-02-10
1       tt0068646                The Godfather    09 21 1972
2       tt0468569              The Dark Knight   23 -07-2008
3       tt0071562       The Godfather: Part II    1975-09-25
4       tt0110912                 Pulp Fiction    1994-10-28
..            ...                          ...           ...
96      tt0070735                    The Sting    1974-03-21
97      tt0082096                     Das Boot    1982-03-18
98      tt0059578  Per qualche dollaro in piÃ¹    1965-12-20
99      tt1832382      Jodaeiye Nader az Simin    2011-10-21
100     tt0045152          Singin' in the Rain    1953-02-05

                         Genrë¨ Duration       Country Content Rating  \
0                         Drama      142           USA              R
1                  Crime, Drama      175           USA              R
2          Action, Crime, Drama      152            US          PG-13
3                  Crime, Drama      220           USA              R
4                  Crime, Drama                    USA              R
..                          ...      ...           ...            ...
96         Comedy, Crime, Drama      129           USA             PG
97   Adventure, Drama, Thriller      149  West Germany              R
98                      Western      132         Italy            NaN
99                        Drama      123          Iran          PG-13
100    Comedy, Musical, Romance      103           USA            NaN

                 Director  Unnamed: 8         Income     Votes  Score
0          Frank Darabont         NaN     $ 28815245  2.278.845   9.3
1    Francis Ford Coppola         NaN    $ 246120974  1.572.674   9.2
2       Christopher Nolan         NaN   $ 1005455211  2.241.615    9.
3    Francis Ford Coppola         NaN  $ 4o8,035,783  1.098.714  9,.0
4       Quentin Tarantino         NaN    $ 222831817  1.780.147  8,9f
..                    ...         ...            ...        ...   ...
96        George Roy Hill         NaN    $ 156000000    236.285   7.5
97      Wolfgang Petersen         NaN     $ 11487676    226.427   7.5
98           Sergio Leone         NaN     $ 15000000    226.039   7.4
99         Asghar Farhadi         NaN     $ 22926076    214.165   7.4
100         Stanley Donen         NaN      $ 1864182    213.152   7.4

[101 rows x 12 columns]>

In [4]:
# Obtaining information about the Data type of the columns
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   IMBD title ID   100 non-null    object
 1   Original titlÊ  100 non-null    object
 2   Release year    100 non-null    object
 3   Genrë¨          100 non-null    object
 4   Duration        99 non-null     object
 5   Country         100 non-null    object
 6   Content Rating  77 non-null     object
 7   Director        100 non-null    object
 8   Unnamed: 8      0 non-null      float64
 9   Income          100 non-null    object
 10   Votes          100 non-null    object
 11  Score           100 non-null    object
dtypes: float64(1), object(11)
memory usage: 9.6+ KB

### 1.0 Cleaning process starts

In [5]:
# Make all the column headers lowercase 
df.columns = df.columns.str.lower()

In [6]:
# Drop the empty unnamed column
df = df.drop('unnamed: 8', axis = 1)

In [7]:
# Interogating the first 10 data in the dataset
df.head(10)

,imbd title id,original titlê,release year,genrë¨,duration,country,content rating,director,income,votes,score
0,tt0111161,The Shawshank Redemption,1995-02-10,Drama,142,USA,R,Frank Darabont,$ 28815245,2.278.845,9.3
1,tt0068646,The Godfather,09 21 1972,"Crime, Drama",175,USA,R,Francis Ford Coppola,$ 246120974,1.572.674,9.2
2,tt0468569,The Dark Knight,23 -07-2008,"Action, Crime, Drama",152,US,PG-13,Christopher Nolan,$ 1005455211,2.241.615,9.
3,tt0071562,The Godfather: Part II,1975-09-25,"Crime, Drama",220,USA,R,Francis Ford Coppola,"$ 4o8,035,783",1.098.714,"9,.0"
4,tt0110912,Pulp Fiction,1994-10-28,"Crime, Drama",,USA,R,Quentin Tarantino,$ 222831817,1.780.147,"8,9f"
5,tt0167260,The Lord of the Rings: The Return of the King,22 Feb 04,"Action, Adventure, Drama",201,New Zealand,PG-13,Peter Jackson,$ 1142271098,1.604.280,08.9
6,tt0108052,Schindler's List,1994-03-11,"Biography, Drama, History",Nan,USA,R,Steven Spielberg,$ 322287794,1.183.248,8.9
7,tt0050083,12 Angry Men,1957-09-04,"Crime, Drama",96,USA,Not Rated,Sidney Lumet,$ 576,668.473,8.9
8,tt1375666,Inception,2010-09-24,"Action, Adventure, Sci-Fi",148,USA,PG-13,Christopher Nolan,$ 869784991,2.002.816,8..8
9,tt0137523,Fight Club,10-29-99,Drama,Inf,UK,R,David Fincher,$ 101218804,1.807.440,8.8

In [8]:
# Interogating the last 10 data in the dataset
df.tail(10)

,imbd title id,original titlê,release year,genrë¨,duration,country,content rating,director,income,votes,score
91,tt0086879,Amadeus,1985-02-15,"Biography, Drama, History",160,USA,R,Milos Forman,$ 52066791,361.028,7.6
92,tt0052357,Vertigo,1958-11-18,"Mystery, Romance, Thriller",128,USA,NaN,Alfred Hitchcock,$ 7796389,352.786,7.5
93,tt0053125,North by Northwest,1959-10-28,"Adventure, Mystery, Thriller",136,USA,NaN,Alfred Hitchcock,$ 73446,291.628,7.5
94,tt2106476,Jagten,2012-11-22,Drama,115,Denmark,R,Thomas Vinterberg,$ 15843274,269.616,7.5
95,tt0056172,Lawrence of Arabia,1963-10-29,"Adventure, Biography, Drama",228,UK,PG,David Lean,$ 45710874,261.504,7.5
96,tt0070735,The Sting,1974-03-21,"Comedy, Crime, Drama",129,USA,PG,George Roy Hill,$ 156000000,236.285,7.5
97,tt0082096,Das Boot,1982-03-18,"Adventure, Drama, Thriller",149,West Germany,R,Wolfgang Petersen,$ 11487676,226.427,7.5
98,tt0059578,Per qualche dollaro in piÃ¹,1965-12-20,Western,132,Italy,NaN,Sergio Leone,$ 15000000,226.039,7.4
99,tt1832382,Jodaeiye Nader az Simin,2011-10-21,Drama,123,Iran,PG-13,Asghar Farhadi,$ 22926076,214.165,7.4
100,tt0045152,Singin' in the Rain,1953-02-05,"Comedy, Musical, Romance",103,USA,NaN,Stanley Donen,$ 1864182,213.152,7.4

In [9]:
# Renaming some column names for easy reference
df = df.rename(columns={'imbd title id':'movie_id','original titlê':'movie_title','genrë¨':'genre',
                   'content rating':'ratings','release year':'release_date'})

In [10]:
# Replace "Inf" with NaN in the dataset
df = df.replace("Inf", float("NaN"))

In [11]:
# Replace "Nan" with NaN in the dataset
df = df.replace("Nan", float("NaN"))

In [12]:
# Checking for rows containing null or missing values
df.isnull().sum()

movie_id         1
movie_title      1
release_date     1
genre            1
duration         4
country          1
ratings         24
director         1
income           1
 votes           1
score            1
dtype: int64

In [13]:
# Dropping all rows containing null or missing values
df = df.dropna()

In [14]:
# Verifying that there are no null or missing values
df.isnull().sum()

movie_id        0
movie_title     0
release_date    0
genre           0
duration        0
country         0
ratings         0
director        0
income          0
 votes          0
score           0
dtype: int64

In [15]:
#Checking for the number of of duplicated rows
df.duplicated().sum()

0

In [16]:
# Verifying that all rows have unique values
df.duplicated().nunique()

1

In [17]:
# Resetting the row index numbers
df = df.reset_index(drop=True)

### 2.0 Checking all the columns

**2.1 Movie_id Column**

In [18]:
# Checking movie_id column
df["movie_id"]

0     tt0111161
1     tt0068646
2     tt0468569
3     tt0071562
4     tt0110912
        ...
69    tt2106476
70    tt0056172
71    tt0070735
72    tt0082096
73    tt1832382
Name: movie_id, Length: 74, dtype: object

In [19]:
# All looks good with movie_id column

**2.2 Movie_title Column**

In [20]:
# Checking movie_title column
df["movie_title"]

0     The Shawshank Redemption
1                The Godfather
2              The Dark Knight
3       The Godfather: Part II
4                 Pulp Fiction
                ...
69                      Jagten
70          Lawrence of Arabia
71                   The Sting
72                    Das Boot
73     Jodaeiye Nader az Simin
Name: movie_title, Length: 74, dtype: object

In [21]:
# Replacing all invalid characters in the column
df["movie_title"] = df["movie_title"].str.replace("©", "c").str.replace("Ã", "A")

In [22]:
df["movie_title"]

0     The Shawshank Redemption
1                The Godfather
2              The Dark Knight
3       The Godfather: Part II
4                 Pulp Fiction
                ...
69                      Jagten
70          Lawrence of Arabia
71                   The Sting
72                    Das Boot
73     Jodaeiye Nader az Simin
Name: movie_title, Length: 74, dtype: object

**2.3 Release_date Column**

In [23]:
# Checking release_date column
df["release_date"]

0       1995-02-10
1       09 21 1972
2      23 -07-2008
3       1975-09-25
4       1994-10-28
          ...
69      2012-11-22
70      1963-10-29
71      1974-03-21
72      1982-03-18
73      2011-10-21
Name: release_date, Length: 74, dtype: object

In [24]:
# Convert to datetime to get all the date in Year-Month-Day format
df['release_date'] = pd.to_datetime(df['release_date'], errors='coerce')

In [25]:
#Checking the maximum and minimum values
df['release_date'].describe()

count                      72
unique                     71
top       2000-05-19 00:00:00
freq                        2
first     1937-03-12 00:00:00
last      2046-11-21 00:00:00
Name: release_date, dtype: object

In [26]:
#Dropping NaT and incorrect date in th column
df = df[~df['release_date'].isin(['NaT', "2046-11-21"])].reset_index(drop=True)

In [27]:
df['release_date'].describe()

count                      71
unique                     70
top       2000-05-19 00:00:00
freq                        2
first     1937-03-12 00:00:00
last      2015-02-12 00:00:00
Name: release_date, dtype: object

In [28]:
df["release_date"]

0    1995-02-10
1    1972-09-21
2    2008-07-23
3    1975-09-25
4    1994-10-28
        ...
66   2012-11-22
67   1963-10-29
68   1974-03-21
69   1982-03-18
70   2011-10-21
Name: release_date, Length: 71, dtype: datetime64[ns]

**2.4 Genre Column**

In [29]:
# Checking Genre column
df["genre"]

0                           Drama
1                    Crime, Drama
2            Action, Crime, Drama
3                    Crime, Drama
4                    Crime, Drama
                 ...
66                          Drama
67    Adventure, Biography, Drama
68           Comedy, Crime, Drama
69     Adventure, Drama, Thriller
70                          Drama
Name: genre, Length: 71, dtype: object

In [30]:
# Replacing and keep first genre catergory in the column
df.genre=df.genre.str.split(',',expand=True)[0].str[0:]

In [31]:
df["genre"]

0         Drama
1         Crime
2        Action
3         Crime
4         Crime
        ...
66        Drama
67    Adventure
68       Comedy
69    Adventure
70        Drama
Name: genre, Length: 71, dtype: object

**2.5 Duration Column**

In [32]:
# Checking Duration column
df["duration"]

0     142
1     175
2     152
3     220
4
     ...
66    115
67    228
68    129
69    149
70    123
Name: duration, Length: 71, dtype: object

In [33]:
# Replacing all invalid characters in the column
df["duration"] = df["duration"].str.replace("Not Applicable", "0").str.replace("-", "0")

In [34]:
# Convert the Duration column to integer
df["duration"] = pd.to_numeric(df["duration"], errors="coerce")

In [35]:
# Replacing NaN and 0 with the mean value in the column
mean = df["duration"].mean()
df["duration"] = df["duration"].replace({0: mean, np.nan: mean})
df["duration"] = df["duration"].astype(int)

In [36]:
df["duration"]

0     142
1     175
2     152
3     220
4     134
     ...
66    115
67    228
68    129
69    149
70    123
Name: duration, Length: 71, dtype: int32

**2.6 Country Column**

In [37]:
# Checking Country column
df["country"]

0              USA
1              USA
2               US
3              USA
4              USA
          ...
66         Denmark
67              UK
68             USA
69    West Germany
70            Iran
Name: country, Length: 71, dtype: object

In [38]:
# Replace misspelt countries in the column names
df["country"] = df["country"].str.replace("US.", "USA",).str.replace("New Zesland", "New Zealand",).str.replace(re.compile(r"New Z[ae]land", re.IGNORECASE), "New Zealand")

In [39]:
df["country"]

0              USA
1              USA
2               US
3              USA
4              USA
          ...
66         Denmark
67              UK
68             USA
69    West Germany
70            Iran
Name: country, Length: 71, dtype: object

**2.7 Ratings Column**

In [40]:
# Checking Ratings column
df["ratings"]

0         R
1         R
2     PG-13
3         R
4         R
      ...
66        R
67       PG
68       PG
69        R
70    PG-13
Name: ratings, Length: 71, dtype: object

In [41]:
# All looks good with movie_id column

**2.8 Director Column**

In [42]:
# Checking Director column
df["director"]

0           Frank Darabont
1     Francis Ford Coppola
2        Christopher Nolan
3     Francis Ford Coppola
4        Quentin Tarantino
              ...
66       Thomas Vinterberg
67              David Lean
68         George Roy Hill
69       Wolfgang Petersen
70          Asghar Farhadi
Name: director, Length: 71, dtype: object

In [43]:
# Replacing all invalid characters in the column
df["director"] = df["director"].str.replace("Ã¡", "ai")

In [44]:
df["director"]

0           Frank Darabont
1     Francis Ford Coppola
2        Christopher Nolan
3     Francis Ford Coppola
4        Quentin Tarantino
              ...
66       Thomas Vinterberg
67              David Lean
68         George Roy Hill
69       Wolfgang Petersen
70          Asghar Farhadi
Name: director, Length: 71, dtype: object

**2.9 Income Column**

In [45]:
# Checking Income column
df["income"]

0        $ 28815245
1       $ 246120974
2      $ 1005455211
3     $ 4o8,035,783
4       $ 222831817
          ...
66       $ 15843274
67       $ 45710874
68      $ 156000000
69       $ 11487676
70       $ 22926076
Name: income, Length: 71, dtype: object

In [46]:
# Replacing all invalid characters in the column
df["income"] = df["income"].astype(str)
df["income"] = df["income"].str.replace(r'\$|,', '')
df["income"] = df["income"].str.replace('o', '0')
df["income"] = pd.to_numeric(df["income"], errors='coerce')

In [47]:
df["income"]

0       28815245
1      246120974
2     1005455211
3      408035783
4      222831817
         ...
66      15843274
67      45710874
68     156000000
69      11487676
70      22926076
Name: income, Length: 71, dtype: int64

**2.10 Votes Column**

In [48]:
# Checking Votes column
df.columns = df.columns.str.replace(" ", "")

In [49]:
# Checking Votes column
df['votes']

0     2.278.845
1     1.572.674
2     2.241.615
3     1.098.714
4     1.780.147
        ...
66      269.616
67      261.504
68      236.285
69      226.427
70      214.165
Name: votes, Length: 71, dtype: object

In [50]:
# All looks good with movie_id column

**2.11 Score Column**

In [51]:
# Checking Score column
df["score"]

0      9.3
1      9.2
2       9.
3     9,.0
4     8,9f
      ...
66     7.5
67     7.5
68     7.5
69     7.5
70     7.4
Name: score, Length: 71, dtype: object

In [52]:
# Replace the invalid characters in the column
df["score"] = df["score"].str.replace(",.", ".").str.replace(".", "").str.replace(":", ".").str.replace("f", "").str.replace("e-0", "").astype(float)

In [53]:
df["score"]

0     93.0
1     92.0
2      9.0
3     90.0
4      8.0
      ...
66    75.0
67    75.0
68    75.0
69    75.0
70    74.0
Name: score, Length: 71, dtype: float64

In [54]:
# Display the cleaned dataframe
df

,movie_id,movie_title,release_date,genre,duration,country,ratings,director,income,votes,score
0,tt0111161,The Shawshank Redemption,1995-02-10,Drama,142,USA,R,Frank Darabont,28815245,2.278.845,93.0
1,tt0068646,The Godfather,1972-09-21,Crime,175,USA,R,Francis Ford Coppola,246120974,1.572.674,92.0
2,tt0468569,The Dark Knight,2008-07-23,Action,152,US,PG-13,Christopher Nolan,1005455211,2.241.615,9.0
3,tt0071562,The Godfather: Part II,1975-09-25,Crime,220,USA,R,Francis Ford Coppola,408035783,1.098.714,90.0
4,tt0110912,Pulp Fiction,1994-10-28,Crime,134,USA,R,Quentin Tarantino,222831817,1.780.147,8.0
...,...,...,...,...,...,...,...,...,...,...,...
66,tt2106476,Jagten,2012-11-22,Drama,115,Denmark,R,Thomas Vinterberg,15843274,269.616,75.0
67,tt0056172,Lawrence of Arabia,1963-10-29,Adventure,228,UK,PG,David Lean,45710874,261.504,75.0
68,tt0070735,The Sting,1974-03-21,Comedy,129,USA,PG,George Roy Hill,156000000,236.285,75.0
69,tt0082096,Das Boot,1982-03-18,Adventure,149,West Germany,R,Wolfgang Petersen,11487676,226.427,75.0
70,tt1832382,Jodaeiye Nader az Simin,2011-10-21,Drama,123,Iran,PG-13,Asghar Farhadi,22926076,214.165,74.0

*** After cleaning and wrangling the messy data of 101 rows and 12 columns, we ended up with 71 rows and 11 columns ***

In [55]:
df.to_csv("cleaned_messy_data.csv", index=False)